<template>
  <div>
    <dv-scroll-board :config="config" style="height: 180px" />
  </div>
</template>

<script>
export default {
  name: "chart04",
  data() {
    return {
      config: {
        header: ["教室号", "申请老师", "申请时间", "申请状态"],
        data: [
          ["1101", "郭嘉星", "2021/12/28", "批准"],
          ["1102", "任启祥", "2021/12/28", "审核中"],
          ["1101", "杨恒宇", "2021/12/29", "未批准"],
          ["1101", "朱俊杰", "2021/12/29", "未批准"],
          ["1101", "刘氏", "2021/12/29", "未批准"],
          ["1101", "周宇", "2021/12/29", "未批准"],
          ["1101", "李豫川", "2021/12/29", "未批准"],
          ["1101", "抒情", "2021/12/29", "未批准"],
          ["1101", "中开枪", "2021/12/29", "未批准"],
          ["1101", "黄宏天", "2021/12/29", "未批准"],
        ],
        headerBGC: "rgba(221, 234, 255, 0.16)", //表头背景色
        oddRowBGC: "transparent", //奇数行背景色
        evenRowBGC: "rgba(221, 234, 255, 0.06)", //偶数行背景色
        headerHeight: 38,
        rowNum: 4,
      },
    };
  },
};
</script>

<style scoped></style>
